# DATA PREPARATION (user)

FICHIER: *'userid-profile.tsv'*

## Imports

In [1]:
import pandas as pd
import numpy as np

## Data import

In [2]:
file = 'raw data/lastfm-dataset-1K/userid-profile.tsv'

df =  pd.read_csv(file, sep='\t',error_bad_lines=False, header = None)

C:\Users\Alumet\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
# On renome les colonnes
df.rename(columns={0:'user_id', 1:'gender', 2:'age', 3:'country', 4:'registered'}, inplace=True)
df = df.iloc[1:]

In [4]:
df.head()

       user_id gender  age        country    registered
1  user_000001      m  NaN          Japan  Aug 13, 2006
2  user_000002      f  NaN           Peru  Feb 24, 2006
3  user_000003      m   22  United States  Oct 30, 2005
4  user_000004      f  NaN            NaN  Apr 26, 2006
5  user_000005      m  NaN       Bulgaria  Jun 29, 2006

In [5]:
# On ne garde que la partie numérique des user_id
df['user_id'] = df['user_id'].apply(lambda x: int(x[5:]))

In [6]:
# On regarde l'état des données manquantes
df.isna().sum()

user_id         0
gender        108
age           706
country        85
registered      8
dtype: int64

### Regroupemant des pays par régions

In [7]:
df['country'].nunique()

66

In [8]:
d = {'Europe': ['Bulgaria', 'Slovakia', 'Poland', 'Poland', 'Finland', 'Romania', 'United Kingdom', 'Germany', 'Sweden', 'Italy',
               'Greece','Croatia', 'Serbia', 'Netherlands','Norway', 'Latvia', 'Spain', 'Estonia', 'Czech Republic', 'Portugal', 
                'Switzerland', 'Ireland', 'Belgium', 'France', 'Hungary','Macedonia', 'Slovenia', 'Malta', 'Austria', 'Lithuania',
                'Iceland', 'Northern Mariana Islands', 'Bosnia and Herzegovina'],
     'Asia': ['Japan', "Korea, Democratic People's Republic of", 'Thailand','Singapore', 'China', 'India', ],
     'South America': ['Peru', 'Mexico','Brazil','Chile', 'Venezuela', 'Trinidad and Tobago', 'Nicaragua', 'Argentina',
                       'Netherlands Antilles', 'Colombia'],
     'North America': ['United States', 'Canada', 'United States Minor Outlying Islands', 'Antarctica', ],
     'Russia': ['Russian Federation', 'Belarus'],
     'North Africa': ['Morocco', 'Algeria', 'Tunisia'],
     'Central Africa': ["Cote D'Ivoire", 'Congo, the Democratic Republic of the'],
     'South Africa': ['Zimbabwe'],
     'Meadel Est': ['Turkey', 'Armenia','Israel'],
     'Oceania': ['Australia', 'New Zealand'],
     'Indonesia': ['British Indian Ocean Territory']
     
    
}

In [9]:
def get_region(x):
    
    for key in d:
        if x in d[key]:
            return key
    return np.nan

In [10]:
df['region'] = df['country'].apply(get_region)

## Transformation des dates

In [11]:
# On ne garde que l'année
def get_date(x):
    
    try:
        return x[-5:]
    except:
        return np.nan


df['registered'] = df['registered'].apply(get_date)

In [12]:
df_user = df[['user_id', 'gender','country', 'region', 'registered']]

In [13]:
df_user.head()

   user_id gender        country         region registered
1        1      m          Japan           Asia       2006
2        2      f           Peru  South America       2006
3        3      m  United States  North America       2005
4        4      f            NaN            NaN       2006
5        5      m       Bulgaria         Europe       2006

## Sauvegarde

In [14]:
df_user.to_csv('filtered data/user_features_fm_dataset.csv')